todos.tex
% Created 2017-10-15 So 11:40
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Adrian}
\date{\today}
\title{todos}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.1.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

This file lists all ToDos for all \LaTeX{}-Packages and Classes in this
 Repo


\section{cheatsheet}
\label{sec-1}
\begin{itemize}
\item $\square$ BUG: Footnotes appear all on the first page
\end{itemize}


\section{HomeworkAssignment}
\label{sec-2}
\subsection{{\bfseries\sffamily TODO} v3.0 [20\%]}
\label{sec-2-1}
\begin{itemize}
\item $\boxtimes$ Rename to homeworkassignment
\begin{itemize}
\item To comply to CTANs requirements of all lowercase packagenames.
\end{itemize}
\item $\square$ Add proof by contradiction environment
\item $\square$ Create environments for all existing proofs
\item $\square$ Add points for excercises
\begin{itemize}
\item Expand \textbackslash \{\} newproblem newsubproblem etc by an
optional argument to take the maximum ammount of point one can
gain at this problem.
\begin{itemize}
\item When passed this is passed to \textbackslash{}newsubproblem,
create a box to write the points down
\item Add this number of points to the »gradingtable«
\end{itemize}
\item To implement this, the existing optional argument, taking
the exercise number has to be replaced with an own command
\begin{itemize}
\item $\square$ replace the optional argument of
\textbackslash{}newproblem by a new command
\textbackslash{}setproblemnumber
\end{itemize}
\end{itemize}
\item $\square$ Add Option to remove the hlines from the layout
\begin{itemize}
\item Standard hlines=all
\item hlines=none remove all
\item hlines=header just remove the hlines around the Title
\end{itemize}
\end{itemize}
% Emacs 25.1.1 (Org mode 8.2.10)
\end{document}